DataProcessors/атл_ЗаполнениеДетальногоГрафикаРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ЗаполнениеДетальногоГрафикаРаботыСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСотрудников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИнтерактивноеОткрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныСменныхГрафиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРабочихДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВыходныхДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаВремениРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/атл_ЗаполнениеДетальногоГрафикаРаботыСотрудников/Forms/ЗаполнениеПоСменномуГрафику/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеньНачала = Параметры.ДеньНачала;
	ГрафикОбслуживания = Параметры.ГрафикОбслуживания;
	
	ВремяРаботыИзГрафикаОбслуживания = 1;
	ДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьЭлементовФормы()
	
	мДоступность = ?(ВремяРаботыИзГрафикаОбслуживания = 0, Истина, Ложь);
	
	Элементы.ВремяС.Доступность = мДоступность;
	Элементы.ВремяПо.Доступность = мДоступность;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяРаботыИзГрафикаОбслуживанияПриИзменении(Элемент)
	
	ДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполнения()	
	
	флагПроверки = Истина;
	
	Если ДеньНачала <= 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите день месяца";
		Сообщение.Поле = "ДеньНачала";
		Сообщение.Сообщить();		
		флагПроверки = Ложь;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГрафикОбслуживания) И ВремяРаботыИзГрафикаОбслуживания = 1 Тогда
		Если ЗначениеЗаполнено(ПолучитьЗначениеКонстантыОсновнойГрафикОбслуживания()) Тогда
			флагПроверки = Ложь;
			мОповещение = Новый ОписаниеОповещения("ПроверкаЗаполненияЗавершение", ЭтотОбъект);
			ПоказатьВопрос(мОповещение, "У сотрудника не указан ""Основной график работы"".
							|График будет заполнен по основному график обслуживания компании. Продолжить?", РежимДиалогаВопрос.ДаНет);			
			
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "У сотрудника и у компании не указан ""Основной график работы"".
								|Поэтому нельзя выбрать вариант ""Время работы из графика обслуживания"". ";
			Сообщение.Сообщить();
			
			ВремяРаботыИзГрафикаОбслуживания = Ложь;
			ДоступностьЭлементовФормы();
			флагПроверки = Ложь;			
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьГрафикРаботыЗавершение();
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Нет ИЛИ ДеньНачала <= 0 Тогда
		флагПроверки = Ложь;
	Иначе
		флагПроверки = Истина;
	КонецЕсли;		
	
	ЗаполнитьГрафикРаботыЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикРаботы(Команда)
	
	ПроверкаЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикРаботыЗавершение()
		
	Если флагПроверки Тогда
		мСтруктура = Новый Структура;
		мСтруктура.Вставить("ДеньНачала", ДеньНачала);
		мСтруктура.Вставить("КоличествоРабочихДней", КоличествоРабочихДней);
		мСтруктура.Вставить("КоличествоВыходных", КоличествоВыходных);
		мСтруктура.Вставить("ВремяС", ВремяС);
		мСтруктура.Вставить("ВремяПо", ВремяПо);
		мСтруктура.Вставить("ВремяРаботыИзГрафикаОбслуживания", ?(ВремяРаботыИзГрафикаОбслуживания = 1, Истина, Ложь));
		
		Закрыть(мСтруктура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстантыОсновнойГрафикОбслуживания()
	
	Возврат Константы.атл_ОсновнойГрафикОбслуживания.Получить();
	
КонецФункции
